commands = '''
**✰` م1` : اوامر السورس.
✰` م2` : اوامر الحساب.
✰` م3` : اوامر الكروبات والاذاعة.
✰` م4` : اوامر التاريخ والبحث والترجمة.
✰` م5` : اوامر التسلية.**
'''
soursce = '''
`- -- -- -- -- -- -- -- --`
**➣source alsid is working ⚡
࿓Dev¹ : @S_i_D
࿓Dev² : @zQQQzQ
࿓Source Ch : @rxx_x - @uJiJs**
`-- -- -- -- -- -- -- -- --`
'''
trans = '''
.ترجمة الى + اللغة
مثلاً | .ترجمة الى العربية (بلرد)
اكتب .اللغات لمعرفة الغات المتاحة !
'''
langs = '''
- العربية
- الانجليزية
- الاسبانية
- الفرنسية
- الروسية
'''
sec1 = '''
`-- -- -- -- -- -- -- -- --`
**✰` .فحص ` : فحص السورس
✰` .المطور ` : مطور السورس
✰` .الاوامر ` :اوامر السورس
✰` .البنك ` : قياس الالبنك
✰` .اعادة تشغيل ` : اعادة تشغيل ل سورس**
`-- -- -- -- -- -- -- -- --`
'''
sec2 = '''
`-- -- -- -- -- -- -- -- --`
✰ .اسم وقتي : اسم وقتي لحسابك
✰ . انهاء الاسم الوقتي : يوقف الاسم الوقتي
✰ .بايو وقتي : بايو وقتي لحسابك
✰ .انهاء البايو الوقتي وقتي : يوقف البايو الوقتي 
✰ .ايدي : ايدي حسابك
✰ .فك حظر : فك حظر كل يلي حاظرهم
-- -- -- -- -- -- -- -- --
✰ .ذاتية لجلب صورة التدمير وحفظها
`-- -- -- -- -- -- -- -- --`
'''
sec3 = """
`-- -- -- -- -- -- -- -- --`
**✰ `.تكرار + العدد + نص` : تكرار للرسائل
✰ ` .اذاعة خاص (بلرد)` : اذاعة لكل شخص في الخاص
✰ ` .اذاعة كروب (بلرد)` : اذاعة لكل الكروبات في الخاص
✰ ` .مؤقت + عدد الثواني + نص` : ارسال رسائل مؤقتة
✰ ` .ادمن` : القنوات يلي انت ادمن بيها
✰ ` .تفليش` : يحظر كل الاعضاء يلي بلمجموعة او القناة اذا كانت عندك صلاحيات الحظر
✰ ` .اشتراكاتي` : جميع القنوات والكروبات والاشخاص في حسابك**
`-- -- -- -- -- -- -- -- --`
"""
sec4 = """
`-- -- -- -- -- -- -- -- --`
**✰ .التاريخ  : التاريخ بليوم والشهر والسنة
**✰ .بحث (الاغنية)  : لتحميل الاغاني من يوتيوب
✰ .الشهر  : الشهر الحالي
✰ .السنة  :السنة الحالية
✰  .الترجمة : اوامر الترجمة **
`-- -- -- -- -- -- -- -- --`
"""
sec5 = """
`-- -- -- -- -- -- -- -- --`
**✰` .قلب `
✰` .قلوب`
✰` .مربعات`
✰` .تهكير`
✰` .حجرة ورقة مقص`
✰` .ملصق`
✰` .ملصق عربي`
✰` .اكس او`**
`-- -- -- -- -- -- -- -- --`
"""
spc = '''
`-- -- -- -- -- -- -- -- --`
✰` .وعد `
✰` .بوت المليار`
`-- -- -- -- -- -- -- -- --`
'''
spc2 = '''
`-- -- -- -- -- -- -- -- --`
✰` .وعد `
✰` .بوت المليار`
✰` .تشكير`
`-- -- -- -- -- -- -- -- --`
'''
progressbar = [
    '⬛⬜⬜⬜⬜⬜⬜⬜⬜⬜ 10%',
    '⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜ 20%',
    '⬛⬛⬛⬜⬜⬜⬜⬜⬜⬜ 30%',
    '⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜ 40%',
    '⬛⬛⬛⬛⬛⬜⬜⬜⬜⬜ 50%',
    '⬛⬛⬛⬛⬛⬛⬜⬜⬜⬜ 60%',
    '⬛⬛⬛⬛⬛⬛⬛⬜⬜⬜ 70%',
    '⬛⬛⬛⬛⬛⬛⬛⬛⬜⬜ 80%',
    '⬛⬛⬛⬛⬛⬛⬛⬛⬛⬜ 90%',
    '⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛ 100%',
]
waad = '''
`-- -- -- -- -- -- -- -- --`
**✰` .استثمار وعد + العدد ` : يستثمر ب وعد تلقائي
✰` .كلمات وعد ` : يلعب كلمات تلقائي**
`-- -- -- -- -- -- -- -- --`
'''
tele_checker = '''
`-- -- -- -- -- -- -- -- --`**
✰ .تثبيت يدوي + القناة + اليوزر  : يثبت اليوزر بقناة معينة
✰ .كلايم + العدد + النوع + القناة  :يفحص يوزرات ويثتبها عقناتك
✰ .تثبيت تلقائي + العدد + القناة + اليوزر  : يثبت اليوزر بقناة معينة
✰ .حالة صيد  : لمعرفة تقدم الكلايم
✰ .حالة التثبيت التلقائي  : لمعرفة تقدم التثبيت التلقائي
✰ .الانواع  : لمعرفة انواع اليوزرات

✰ .تشكير  : لمعرفة الاوامر بالشكل الصحيح
**`-- -- -- -- -- -- -- -- --`
'''
tele_checker2 = '''
الانواع :
1 : سداسي حرفين
2 : شبه ثلاثي
3 : سداسي حرف واحد
4 : يوزر بوت ثلاثي
5 : خماسي حرفين
6 : خماسي حرف
7 : سباعي حرف
مثال : .صيد 400 5 ss_iid
للتوضيح اكثر قم بكتابة .تشكير

☆ Alsid : @ss_iid
'''
zmmbot = '''
`-- -- -- -- -- -- -- -- --`**
✰` .تجميع المليار ` : يشترك ب قنوات بوت المليار تلقائي
**`-- -- -- -- -- -- -- -- --`
'''
